Ran Plan for dir: `opentofu` workspace: `prod`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/tofu plan -input=false -refresh -out "/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/prod-prod.tfplan" -var-file ./env/prod.tfvars -var environment=prod -var-file /atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/env/prod.tfvars' in '/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu': exit status 1
data.mongodbatlas_roles_org_id.org: Reading...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.hetzner-vps.hcloud_firewall.firewall will be created
  + resource "hcloud_firewall" "firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "firewall"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "5432"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # module.hetzner-vps.hcloud_primary_ip.primary_ip will be created
  + resource "hcloud_primary_ip" "primary_ip" {
      + assignee_id       = (known after apply)
      + assignee_type     = "server"
      + auto_delete       = false
      + datacenter        = (known after apply)
      + delete_protection = false
      + id                = (known after apply)
      + ip_address        = (known after apply)
      + ip_network        = (known after apply)
      + name              = "primary_ip"
      + type              = "ipv4"
    }

  # module.hetzner-vps.hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = true
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-12"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = (known after apply)
      + name                       = "postgres"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }

  # module.hetzner-vps.hcloud_ssh_key.ssh_key["ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"] will be created
  + resource "hcloud_ssh_key" "ssh_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {}
      + name        = "Jared"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: error getting API Key's org assigned (https://cloud.mongodb.com/api/atlas/v2 GET: HTTP 403 Forbidden (Error code: "IP_ADDRESS_NOT_ON_ACCESS_LIST") Detail: IP address 82.47.5.131 is not allowed to access this resource. Reason: Forbidden. Params: [82.47.5.131], BadRequestDetail: ): 
│ 
│   with data.mongodbatlas_roles_org_id.org,
│   on data.tf line 1, in data "mongodbatlas_roles_org_id" "org":
│    1: data "mongodbatlas_roles_org_id" "org" {}
│ 
╵
╷
│ Error: [FATAL] Failed to create MinIO client (client_creation): failed to create S3 client: Endpoint: ... does not follow ip address or domain name standards.
│ 
│   with provider["registry.opentofu.org/aminueza/minio"],
│   on provider.tf line 3, in provider "minio":
│    3: provider "minio" {
│ 
╵


```
</details>